#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Backrooms

#include "Basic.hpp"

#include "XShip_structs.hpp"
#include "InteractiveToolsFramework_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "Backrooms_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AdvancedSessions_classes.hpp"
#include "SlateCore_structs.hpp"
#include "HeadMountedDisplay_classes.hpp"


namespace SDK
{

// Class Backrooms.InteractableActor
// 0x0028 (0x0248 - 0x0220)
class AInteractableActor : public AActor
{
public:
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             UsedSound;                                         // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsUsable;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          WasUsed;                                           // 0x0241(0x0001)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldAimAssist;                                  // 0x0242(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BlockUsage();
	void OnBeginHighlight();
	void OnEndHighlight();
	void OnInteractStartedLocal();
	void OnRep_IsUsable();
	void OnRep_WasUsed();
	void OnUsedAll();
	void OnUsedMulticast();
	void OnUsedNotify();
	void OnUsedServer();
	void ResetUsage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractableActor">();
	}
	static class AInteractableActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractableActor>();
	}
};
static_assert(alignof(AInteractableActor) == 0x000008, "Wrong alignment on AInteractableActor");
static_assert(sizeof(AInteractableActor) == 0x000248, "Wrong size on AInteractableActor");
static_assert(offsetof(AInteractableActor, SceneComponent) == 0x000228, "Member 'AInteractableActor::SceneComponent' has a wrong offset!");
static_assert(offsetof(AInteractableActor, StaticMesh) == 0x000230, "Member 'AInteractableActor::StaticMesh' has a wrong offset!");
static_assert(offsetof(AInteractableActor, UsedSound) == 0x000238, "Member 'AInteractableActor::UsedSound' has a wrong offset!");
static_assert(offsetof(AInteractableActor, IsUsable) == 0x000240, "Member 'AInteractableActor::IsUsable' has a wrong offset!");
static_assert(offsetof(AInteractableActor, WasUsed) == 0x000241, "Member 'AInteractableActor::WasUsed' has a wrong offset!");
static_assert(offsetof(AInteractableActor, bShouldAimAssist) == 0x000242, "Member 'AInteractableActor::bShouldAimAssist' has a wrong offset!");

// Class Backrooms.PushableActor
// 0x0008 (0x0250 - 0x0248)
class APushableActor : public AInteractableActor
{
public:
	float                                         Density;                                           // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetClosesPoint(class AActor* InActor);
	TArray<struct FVector> GetForwardBoundingPoints(bool InInvert);
	TArray<struct FVector> GetRightBoundingPoints(bool InInvert);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PushableActor">();
	}
	static class APushableActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APushableActor>();
	}
};
static_assert(alignof(APushableActor) == 0x000008, "Wrong alignment on APushableActor");
static_assert(sizeof(APushableActor) == 0x000250, "Wrong size on APushableActor");
static_assert(offsetof(APushableActor, Density) == 0x000248, "Member 'APushableActor::Density' has a wrong offset!");

// Class Backrooms.AI_ObjectWC
// 0x0000 (0x0028 - 0x0028)
class UAI_ObjectWC final : public UObject
{
public:
	void FinishExecute();
	bool GetWeight();
	void OnUpdate();
	void StartExecute();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_ObjectWC">();
	}
	static class UAI_ObjectWC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_ObjectWC>();
	}
};
static_assert(alignof(UAI_ObjectWC) == 0x000008, "Wrong alignment on UAI_ObjectWC");
static_assert(sizeof(UAI_ObjectWC) == 0x000028, "Wrong size on UAI_ObjectWC");

// Class Backrooms.MissionData
// 0x0040 (0x0068 - 0x0028)
class UMissionData final : public UObject
{
public:
	class FString                                 TargetEscapeLevel;                                 // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeCompleted;                                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         PlayerDeaths;                                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         EntitySightings;                                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         LowSanityAmount;                                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         XPPenalty;                                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LevelBaseXP;                                       // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LevelTimeLimit;                                    // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MissionDataRowName;                                // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AddEntitySighting();
	void AddLowSanityAmount();
	void AddPlayerDeath();
	void SetTimeCompleted(float Time);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MissionData">();
	}
	static class UMissionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionData>();
	}
};
static_assert(alignof(UMissionData) == 0x000008, "Wrong alignment on UMissionData");
static_assert(sizeof(UMissionData) == 0x000068, "Wrong size on UMissionData");
static_assert(offsetof(UMissionData, TargetEscapeLevel) == 0x000028, "Member 'UMissionData::TargetEscapeLevel' has a wrong offset!");
static_assert(offsetof(UMissionData, TimeCompleted) == 0x000038, "Member 'UMissionData::TimeCompleted' has a wrong offset!");
static_assert(offsetof(UMissionData, PlayerDeaths) == 0x00003C, "Member 'UMissionData::PlayerDeaths' has a wrong offset!");
static_assert(offsetof(UMissionData, EntitySightings) == 0x000040, "Member 'UMissionData::EntitySightings' has a wrong offset!");
static_assert(offsetof(UMissionData, LowSanityAmount) == 0x000044, "Member 'UMissionData::LowSanityAmount' has a wrong offset!");
static_assert(offsetof(UMissionData, XPPenalty) == 0x000048, "Member 'UMissionData::XPPenalty' has a wrong offset!");
static_assert(offsetof(UMissionData, LevelBaseXP) == 0x00004C, "Member 'UMissionData::LevelBaseXP' has a wrong offset!");
static_assert(offsetof(UMissionData, LevelTimeLimit) == 0x000050, "Member 'UMissionData::LevelTimeLimit' has a wrong offset!");
static_assert(offsetof(UMissionData, MissionDataRowName) == 0x000058, "Member 'UMissionData::MissionDataRowName' has a wrong offset!");

// Class Backrooms.AimAssistComponent
// 0x0108 (0x01B8 - 0x00B0)
class UAimAssistComponent : public UActorComponent
{
public:
	TMap<class FName, struct FAimAssistSettings>  Configuration;                                     // 0x00B0(0x0050)(Edit, BlueprintVisible, SimpleDisplay, NativeAccessSpecifierPublic)
	ECollisionSelectionMethod                     CollisionMethod;                                   // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannel;                                  // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCollisionProfileName                  CollisionProfile;                                  // 0x0104(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EAimAssistCastType                            TargetSeekerCastType;                              // 0x010C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxSphereCastCount;                                // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimAssistRadius;                                   // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeAngle;                                         // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConeTraceSubdivision;                              // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearClipDistance;                                  // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FarClipDistance;                                   // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PreferredBone;                                     // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class UAimAssistComponent* Sender, const struct FAimAssistTarget& AimAssistTarget)> TargetFound; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class UAimAssistComponent* Sender, const struct FAimAssistTarget& AimAssistTarget)> TargetLost; // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bCreateReticle;                                    // 0x0150(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PlayerController;                                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFancyCharacter*                        Character;                                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCharacterMovementComponent*            CharacterMovement;                                 // 0x0168(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_170[0x48];                                     // 0x0170(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckCanMove();
	void OnAimAssistDeviceEnabled(bool IsGamepad);
	const struct FRotator ProcessAimAssist(const float DeltaTime);

	struct FAimAssistTarget GetCurrentTargetOrDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimAssistComponent">();
	}
	static class UAimAssistComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimAssistComponent>();
	}
};
static_assert(alignof(UAimAssistComponent) == 0x000008, "Wrong alignment on UAimAssistComponent");
static_assert(sizeof(UAimAssistComponent) == 0x0001B8, "Wrong size on UAimAssistComponent");
static_assert(offsetof(UAimAssistComponent, Configuration) == 0x0000B0, "Member 'UAimAssistComponent::Configuration' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, CollisionMethod) == 0x000100, "Member 'UAimAssistComponent::CollisionMethod' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, CollisionChannel) == 0x000101, "Member 'UAimAssistComponent::CollisionChannel' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, CollisionProfile) == 0x000104, "Member 'UAimAssistComponent::CollisionProfile' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, TargetSeekerCastType) == 0x00010C, "Member 'UAimAssistComponent::TargetSeekerCastType' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, MaxSphereCastCount) == 0x000110, "Member 'UAimAssistComponent::MaxSphereCastCount' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, AimAssistRadius) == 0x000114, "Member 'UAimAssistComponent::AimAssistRadius' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, ConeAngle) == 0x000118, "Member 'UAimAssistComponent::ConeAngle' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, ConeTraceSubdivision) == 0x00011C, "Member 'UAimAssistComponent::ConeTraceSubdivision' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, NearClipDistance) == 0x000120, "Member 'UAimAssistComponent::NearClipDistance' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, FarClipDistance) == 0x000124, "Member 'UAimAssistComponent::FarClipDistance' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, PreferredBone) == 0x000128, "Member 'UAimAssistComponent::PreferredBone' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, TargetFound) == 0x000130, "Member 'UAimAssistComponent::TargetFound' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, TargetLost) == 0x000140, "Member 'UAimAssistComponent::TargetLost' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, bCreateReticle) == 0x000150, "Member 'UAimAssistComponent::bCreateReticle' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, PlayerController) == 0x000158, "Member 'UAimAssistComponent::PlayerController' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, Character) == 0x000160, "Member 'UAimAssistComponent::Character' has a wrong offset!");
static_assert(offsetof(UAimAssistComponent, CharacterMovement) == 0x000168, "Member 'UAimAssistComponent::CharacterMovement' has a wrong offset!");

// Class Backrooms.BackroomsBPFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBackroomsBPFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float AddXP(float xpToAdd);
	static bool CanNavigationReachPoint(class APawn* Pawn, const struct FVector& StartLocation, const struct FVector& EndLocation);
	static void ClearCharacterFloor(class ACharacter* Character);
	static void ClearVoice();
	static void DeleteInputSettings();
	static class FName DetectCurrentGesture(const TArray<float>& PoseFingerCurls, class UOpenInputGestureDatabase* GesturesDB);
	static TArray<class FString> GetAllSaveGameSlotNames();
	static struct FDateTime GetDateFromSeconds(int32 Seconds);
	static int32 GetIndexOfClosestSplinePoint(class USplineComponent* SplineComponent, const struct FVector& WorldLocation);
	static TArray<class APlayerState*> GetPlayerStateArray(class AGameStateBase* GameState);
	static TArray<class FString> GetSaveGameSlotsByType(const class FString& Prefix);
	static TArray<struct FVector> GetSplinePoints(class USplineComponent* SplineComponent);
	static int32 GetSystemTimeSeconds(const struct FDateTime& DateTime);
	static float GetViewDistanceScale();
	static bool IsNoHMDMode();
	static void K2_IsTearingDown(class UObject* caller, bool* isTearingDown);
	static float LoadXP();
	static void PatchMissingInputActions(const TArray<struct FInputActionKeyMapping>& NewActions);
	static class UTimelineComponent* PlayRate(class UTimelineComponent* Timeline, float Sec);
	static void ReloadBindings();
	static void ResetInputSettings();
	static void ResetWorldTime(const class AGameMode* GameMode);
	static void SaveToClipboard(const class FString& ToClipboard);
	static void SetCurrentLevelLogs(const class FString& LevelName);
	static void SetLogValue(const class FString& Key, const class FString& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BackroomsBPFunctionLibrary">();
	}
	static class UBackroomsBPFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackroomsBPFunctionLibrary>();
	}
};
static_assert(alignof(UBackroomsBPFunctionLibrary) == 0x000008, "Wrong alignment on UBackroomsBPFunctionLibrary");
static_assert(sizeof(UBackroomsBPFunctionLibrary) == 0x000028, "Wrong size on UBackroomsBPFunctionLibrary");

// Class Backrooms.MapEditorCharacter
// 0x0000 (0x04C0 - 0x04C0)
class AMapEditorCharacter final : public ACharacter
{
public:
	class UCameraComponent*                       CameraComponent;                                   // 0x04B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MapEditorCharacter">();
	}
	static class AMapEditorCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMapEditorCharacter>();
	}
};
static_assert(alignof(AMapEditorCharacter) == 0x000010, "Wrong alignment on AMapEditorCharacter");
static_assert(sizeof(AMapEditorCharacter) == 0x0004C0, "Wrong size on AMapEditorCharacter");
static_assert(offsetof(AMapEditorCharacter, CameraComponent) == 0x0004B8, "Member 'AMapEditorCharacter::CameraComponent' has a wrong offset!");

// Class Backrooms.BoatComponent
// 0x00D8 (0x0188 - 0x00B0)
class UBoatComponent final : public UActorComponent
{
public:
	TArray<struct FXShipFloater>                  XShipFloaters;                                     // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FXShipEngine>                   XShipEngines;                                      // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         WaterDensity;                                      // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirDensity;                                        // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaterWorldZ;                                       // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCustomShipBoundsRadius;                           // 0x00DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShipBoundsRadius;                                  // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InWaterLinearDamping;                              // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutWaterLinearDamping;                             // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InWaterAngularDamping;                             // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutWaterAngularDamping;                            // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementAccelerationSpeed;                         // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementBrakingSpeed;                              // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementSideDampingSpeed;                          // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOrientRotationToMovement;                         // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanMoveBackwardWithOrientRotation;                // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ToleranceForMoveBackwardWithOrientRotation;        // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRotationSpeed;                                  // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationAccelerationSpeed;                         // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationBrakingSpeed;                              // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMultiplyRotationBySpeed;                          // 0x0114(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpeedForMaxRotation;                               // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStabilization;                              // 0x011C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStabilizationInAir;                         // 0x011D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InAirAngularStabilizationSpeed;                    // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InAirAngularStabilizationDamping;                  // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularStabilizationSpeed;                         // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularStabilizationDamping;                       // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearStabilizationDamping;                        // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSyncMovement;                                     // 0x0134(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SendPacketInterval;                                // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClientSyncSpeed;                                   // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceReplication;                                 // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRepXShipMovement                      RepXShipMovement;                                  // 0x0144(0x0030)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         SendPacketIntervalLocal;                           // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                MovementInput;                                     // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationInput;                                     // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void DisableAllEngines();
	void DisableAllFloaters();
	void EnableAllEngines();
	void EnableAllFloaters();
	float GetShipBoundsRadius();
	class ABoatPawn* GetXShipPawn();
	bool IsEngineInWater();
	void Server_PassMovementInfo(const struct FRepXShipMovement& NewRepXShipMovement);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoatComponent">();
	}
	static class UBoatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoatComponent>();
	}
};
static_assert(alignof(UBoatComponent) == 0x000008, "Wrong alignment on UBoatComponent");
static_assert(sizeof(UBoatComponent) == 0x000188, "Wrong size on UBoatComponent");
static_assert(offsetof(UBoatComponent, XShipFloaters) == 0x0000B0, "Member 'UBoatComponent::XShipFloaters' has a wrong offset!");
static_assert(offsetof(UBoatComponent, XShipEngines) == 0x0000C0, "Member 'UBoatComponent::XShipEngines' has a wrong offset!");
static_assert(offsetof(UBoatComponent, WaterDensity) == 0x0000D0, "Member 'UBoatComponent::WaterDensity' has a wrong offset!");
static_assert(offsetof(UBoatComponent, AirDensity) == 0x0000D4, "Member 'UBoatComponent::AirDensity' has a wrong offset!");
static_assert(offsetof(UBoatComponent, WaterWorldZ) == 0x0000D8, "Member 'UBoatComponent::WaterWorldZ' has a wrong offset!");
static_assert(offsetof(UBoatComponent, bCustomShipBoundsRadius) == 0x0000DC, "Member 'UBoatComponent::bCustomShipBoundsRadius' has a wrong offset!");
static_assert(offsetof(UBoatComponent, ShipBoundsRadius) == 0x0000E0, "Member 'UBoatComponent::ShipBoundsRadius' has a wrong offset!");
static_assert(offsetof(UBoatComponent, InWaterLinearDamping) == 0x0000E4, "Member 'UBoatComponent::InWaterLinearDamping' has a wrong offset!");
static_assert(offsetof(UBoatComponent, OutWaterLinearDamping) == 0x0000E8, "Member 'UBoatComponent::OutWaterLinearDamping' has a wrong offset!");
static_assert(offsetof(UBoatComponent, InWaterAngularDamping) == 0x0000EC, "Member 'UBoatComponent::InWaterAngularDamping' has a wrong offset!");
static_assert(offsetof(UBoatComponent, OutWaterAngularDamping) == 0x0000F0, "Member 'UBoatComponent::OutWaterAngularDamping' has a wrong offset!");
static_assert(offsetof(UBoatComponent, MovementAccelerationSpeed) == 0x0000F4, "Member 'UBoatComponent::MovementAccelerationSpeed' has a wrong offset!");
static_assert(offsetof(UBoatComponent, MovementBrakingSpeed) == 0x0000F8, "Member 'UBoatComponent::MovementBrakingSpeed' has a wrong offset!");
static_assert(offsetof(UBoatComponent, MovementSideDampingSpeed) == 0x0000FC, "Member 'UBoatComponent::MovementSideDampingSpeed' has a wrong offset!");
static_assert(offsetof(UBoatComponent, bOrientRotationToMovement) == 0x000100, "Member 'UBoatComponent::bOrientRotationToMovement' has a wrong offset!");
static_assert(offsetof(UBoatComponent, bCanMoveBackwardWithOrientRotation) == 0x000101, "Member 'UBoatComponent::bCanMoveBackwardWithOrientRotation' has a wrong offset!");
static_assert(offsetof(UBoatComponent, ToleranceForMoveBackwardWithOrientRotation) == 0x000104, "Member 'UBoatComponent::ToleranceForMoveBackwardWithOrientRotation' has a wrong offset!");
static_assert(offsetof(UBoatComponent, MaxRotationSpeed) == 0x000108, "Member 'UBoatComponent::MaxRotationSpeed' has a wrong offset!");
static_assert(offsetof(UBoatComponent, RotationAccelerationSpeed) == 0x00010C, "Member 'UBoatComponent::RotationAccelerationSpeed' has a wrong offset!");
static_assert(offsetof(UBoatComponent, RotationBrakingSpeed) == 0x000110, "Member 'UBoatComponent::RotationBrakingSpeed' has a wrong offset!");
static_assert(offsetof(UBoatComponent, bMultiplyRotationBySpeed) == 0x000114, "Member 'UBoatComponent::bMultiplyRotationBySpeed' has a wrong offset!");
static_assert(offsetof(UBoatComponent, SpeedForMaxRotation) == 0x000118, "Member 'UBoatComponent::SpeedForMaxRotation' has a wrong offset!");
static_assert(offsetof(UBoatComponent, bEnableStabilization) == 0x00011C, "Member 'UBoatComponent::bEnableStabilization' has a wrong offset!");
static_assert(offsetof(UBoatComponent, bEnableStabilizationInAir) == 0x00011D, "Member 'UBoatComponent::bEnableStabilizationInAir' has a wrong offset!");
static_assert(offsetof(UBoatComponent, InAirAngularStabilizationSpeed) == 0x000120, "Member 'UBoatComponent::InAirAngularStabilizationSpeed' has a wrong offset!");
static_assert(offsetof(UBoatComponent, InAirAngularStabilizationDamping) == 0x000124, "Member 'UBoatComponent::InAirAngularStabilizationDamping' has a wrong offset!");
static_assert(offsetof(UBoatComponent, AngularStabilizationSpeed) == 0x000128, "Member 'UBoatComponent::AngularStabilizationSpeed' has a wrong offset!");
static_assert(offsetof(UBoatComponent, AngularStabilizationDamping) == 0x00012C, "Member 'UBoatComponent::AngularStabilizationDamping' has a wrong offset!");
static_assert(offsetof(UBoatComponent, LinearStabilizationDamping) == 0x000130, "Member 'UBoatComponent::LinearStabilizationDamping' has a wrong offset!");
static_assert(offsetof(UBoatComponent, bSyncMovement) == 0x000134, "Member 'UBoatComponent::bSyncMovement' has a wrong offset!");
static_assert(offsetof(UBoatComponent, SendPacketInterval) == 0x000138, "Member 'UBoatComponent::SendPacketInterval' has a wrong offset!");
static_assert(offsetof(UBoatComponent, ClientSyncSpeed) == 0x00013C, "Member 'UBoatComponent::ClientSyncSpeed' has a wrong offset!");
static_assert(offsetof(UBoatComponent, bForceReplication) == 0x000140, "Member 'UBoatComponent::bForceReplication' has a wrong offset!");
static_assert(offsetof(UBoatComponent, RepXShipMovement) == 0x000144, "Member 'UBoatComponent::RepXShipMovement' has a wrong offset!");
static_assert(offsetof(UBoatComponent, SendPacketIntervalLocal) == 0x000174, "Member 'UBoatComponent::SendPacketIntervalLocal' has a wrong offset!");
static_assert(offsetof(UBoatComponent, MovementInput) == 0x000178, "Member 'UBoatComponent::MovementInput' has a wrong offset!");
static_assert(offsetof(UBoatComponent, RotationInput) == 0x000184, "Member 'UBoatComponent::RotationInput' has a wrong offset!");

// Class Backrooms.FancyCharacter
// 0x0060 (0x0520 - 0x04C0)
class AFancyCharacter : public ACharacter
{
public:
	bool                                          CanMove;                                           // 0x04B8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TraceLength;                                       // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDead;                                           // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUsingItem;                                       // 0x04C1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLeaning;                                         // 0x04C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanCollide;                                        // 0x04C3(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverlapOnly;                                     // 0x04C4(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCameraShake;                                // 0x04C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAimAssist;                                  // 0x04C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C7[0x1];                                      // 0x04C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ADroppedItem*                           CurrentFocusedItem;                                // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AInteractablePawn*                      CurrentInteractingPawn;                            // 0x04D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APushableActor*                         CurrentPushableActor;                              // 0x04D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFancyCameraComponent*                  CameraComponent;                                   // 0x04E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFancySpringArmComponent*               SpringArm;                                         // 0x04E8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 Arms;                                              // 0x04F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFancyCarrySystemCarrier*               CarrySystem;                                       // 0x04F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 CurrentInteractableActor;                          // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_508[0x18];                                     // 0x0508(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangeCrosshairVisibility(bool IsVisible);
	void CheckPawn();
	void CheckSpawnedItems();
	void HideItem(bool IsVisible);
	void Interact(class AActor* Actor);
	void InteractCallBackVR(class AActor* Actor);
	void KillPlayer(bool bResetInteractable);
	void OnRep_CanCollide();
	void OnRep_IsOverlapOnly();
	void OnSanityUpdate(float Sanity);
	void SetCanCollide(bool ShouldCollide);
	void SetIsOverlapOnly(bool ShouldOverlapOnly);
	void StopPushing();
	void ToggleBlur(bool ShouldBlur);
	void TogglePlayerLegs(bool IsHidden);
	void TogglePlayerVisibility(bool IsHidden);
	void TryPickup();

	class AActor* GetCurrentInteractableActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FancyCharacter">();
	}
	static class AFancyCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFancyCharacter>();
	}
};
static_assert(alignof(AFancyCharacter) == 0x000010, "Wrong alignment on AFancyCharacter");
static_assert(sizeof(AFancyCharacter) == 0x000520, "Wrong size on AFancyCharacter");
static_assert(offsetof(AFancyCharacter, CanMove) == 0x0004B8, "Member 'AFancyCharacter::CanMove' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, TraceLength) == 0x0004BC, "Member 'AFancyCharacter::TraceLength' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, bIsDead) == 0x0004C0, "Member 'AFancyCharacter::bIsDead' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, IsUsingItem) == 0x0004C1, "Member 'AFancyCharacter::IsUsingItem' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, IsLeaning) == 0x0004C2, "Member 'AFancyCharacter::IsLeaning' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, CanCollide) == 0x0004C3, "Member 'AFancyCharacter::CanCollide' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, IsOverlapOnly) == 0x0004C4, "Member 'AFancyCharacter::IsOverlapOnly' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, bEnableCameraShake) == 0x0004C5, "Member 'AFancyCharacter::bEnableCameraShake' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, bEnableAimAssist) == 0x0004C6, "Member 'AFancyCharacter::bEnableAimAssist' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, CurrentFocusedItem) == 0x0004C8, "Member 'AFancyCharacter::CurrentFocusedItem' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, CurrentInteractingPawn) == 0x0004D0, "Member 'AFancyCharacter::CurrentInteractingPawn' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, CurrentPushableActor) == 0x0004D8, "Member 'AFancyCharacter::CurrentPushableActor' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, CameraComponent) == 0x0004E0, "Member 'AFancyCharacter::CameraComponent' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, SpringArm) == 0x0004E8, "Member 'AFancyCharacter::SpringArm' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, Arms) == 0x0004F0, "Member 'AFancyCharacter::Arms' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, CarrySystem) == 0x0004F8, "Member 'AFancyCharacter::CarrySystem' has a wrong offset!");
static_assert(offsetof(AFancyCharacter, CurrentInteractableActor) == 0x000500, "Member 'AFancyCharacter::CurrentInteractableActor' has a wrong offset!");

// Class Backrooms.InteractablePawn
// 0x0080 (0x0300 - 0x0280)
class AInteractablePawn : public APawn
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x0288(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsUsable;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          WasUsed;                                           // 0x0299(0x0001)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CachedRotation;                                    // 0x029C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bShouldCameraShake;                                // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteractDelay;                                     // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VROffset;                                          // 0x02B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldCheck;                                       // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HideCursor;                                        // 0x02BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldHidePlayer;                                  // 0x02BE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldStopMovement;                                // 0x02BF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACharacter*                             InteractingPlayer;                                 // 0x02C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      InteractingController;                             // 0x02C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraShakeBase>           IdleShake;                                         // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAimAssist;                                  // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D9[0xF];                                      // 0x02D9(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableCameraComponent*           InteractableCameraComponent;                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMotionControllerComponent*             LeftGrip;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMotionControllerComponent*             RightGrip;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BlockUsage();
	void OnAttemptUse(bool CanUse);
	void OnHiddenPossess(class ACharacter* Character);
	void OnPossess();
	void OnRep_IsUsable();
	void OnRep_WasUsed();
	void OnStartInteracting(class ACharacter* Character);
	void OnStopInteracting();
	void OnUnPossess();
	void OnUsedAll();
	void OnUsedMulticast();
	void OnUsedNotify();
	void OnUsedServer(class ACharacter* Character);
	void OnVRPossess(bool bPossess);
	void ResetUsage();
	void SetCameraPostProcessing(class ACharacter* Character);
	void SetUsingVR(class ACharacter* Character, bool bPossess);
	void ToggleMouse(bool bHide);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractablePawn">();
	}
	static class AInteractablePawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractablePawn>();
	}
};
static_assert(alignof(AInteractablePawn) == 0x000008, "Wrong alignment on AInteractablePawn");
static_assert(sizeof(AInteractablePawn) == 0x000300, "Wrong size on AInteractablePawn");
static_assert(offsetof(AInteractablePawn, SceneComponent) == 0x000288, "Member 'AInteractablePawn::SceneComponent' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, StaticMesh) == 0x000290, "Member 'AInteractablePawn::StaticMesh' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, IsUsable) == 0x000298, "Member 'AInteractablePawn::IsUsable' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, WasUsed) == 0x000299, "Member 'AInteractablePawn::WasUsed' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, CachedRotation) == 0x00029C, "Member 'AInteractablePawn::CachedRotation' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, bShouldCameraShake) == 0x0002A8, "Member 'AInteractablePawn::bShouldCameraShake' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, InteractDelay) == 0x0002AC, "Member 'AInteractablePawn::InteractDelay' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, VROffset) == 0x0002B0, "Member 'AInteractablePawn::VROffset' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, ShouldCheck) == 0x0002BC, "Member 'AInteractablePawn::ShouldCheck' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, HideCursor) == 0x0002BD, "Member 'AInteractablePawn::HideCursor' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, ShouldHidePlayer) == 0x0002BE, "Member 'AInteractablePawn::ShouldHidePlayer' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, ShouldStopMovement) == 0x0002BF, "Member 'AInteractablePawn::ShouldStopMovement' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, InteractingPlayer) == 0x0002C0, "Member 'AInteractablePawn::InteractingPlayer' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, InteractingController) == 0x0002C8, "Member 'AInteractablePawn::InteractingController' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, IdleShake) == 0x0002D0, "Member 'AInteractablePawn::IdleShake' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, bShouldAimAssist) == 0x0002D8, "Member 'AInteractablePawn::bShouldAimAssist' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, InteractableCameraComponent) == 0x0002E8, "Member 'AInteractablePawn::InteractableCameraComponent' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, LeftGrip) == 0x0002F0, "Member 'AInteractablePawn::LeftGrip' has a wrong offset!");
static_assert(offsetof(AInteractablePawn, RightGrip) == 0x0002F8, "Member 'AInteractablePawn::RightGrip' has a wrong offset!");

// Class Backrooms.PlayerStatsComponent
// 0x0010 (0x00C0 - 0x00B0)
class UPlayerStatsComponent final : public UActorComponent
{
public:
	TArray<struct FCollectible>                   Collectibles;                                      // 0x00B0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerStatsComponent">();
	}
	static class UPlayerStatsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerStatsComponent>();
	}
};
static_assert(alignof(UPlayerStatsComponent) == 0x000008, "Wrong alignment on UPlayerStatsComponent");
static_assert(sizeof(UPlayerStatsComponent) == 0x0000C0, "Wrong size on UPlayerStatsComponent");
static_assert(offsetof(UPlayerStatsComponent, Collectibles) == 0x0000B0, "Member 'UPlayerStatsComponent::Collectibles' has a wrong offset!");

// Class Backrooms.BoatPawn
// 0x0020 (0x0320 - 0x0300)
class ABoatPawn : public AInteractablePawn
{
public:
	class UBoxComponent*                          RootBoxComponent;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArrowComponent*                        ArrowComponent;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoatComponent*                         BoatComponent;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   BoatMaskMesh;                                      // 0x0318(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AddRotationInput(float ScaleValue);
	float GetWaterDensity(const struct FVector2D& InLocation);
	struct FVector GetWaterNormal(const struct FVector2D& InLocation);
	float GetWaterWorldZ(const struct FVector2D& InLocation);
	class UBoatComponent* GetXShipComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoatPawn">();
	}
	static class ABoatPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoatPawn>();
	}
};
static_assert(alignof(ABoatPawn) == 0x000008, "Wrong alignment on ABoatPawn");
static_assert(sizeof(ABoatPawn) == 0x000320, "Wrong size on ABoatPawn");
static_assert(offsetof(ABoatPawn, RootBoxComponent) == 0x000300, "Member 'ABoatPawn::RootBoxComponent' has a wrong offset!");
static_assert(offsetof(ABoatPawn, ArrowComponent) == 0x000308, "Member 'ABoatPawn::ArrowComponent' has a wrong offset!");
static_assert(offsetof(ABoatPawn, BoatComponent) == 0x000310, "Member 'ABoatPawn::BoatComponent' has a wrong offset!");
static_assert(offsetof(ABoatPawn, BoatMaskMesh) == 0x000318, "Member 'ABoatPawn::BoatMaskMesh' has a wrong offset!");

// Class Backrooms.DryLandVolume
// 0x0000 (0x0258 - 0x0258)
class ADryLandVolume final : public AVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DryLandVolume">();
	}
	static class ADryLandVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADryLandVolume>();
	}
};
static_assert(alignof(ADryLandVolume) == 0x000008, "Wrong alignment on ADryLandVolume");
static_assert(sizeof(ADryLandVolume) == 0x000258, "Wrong size on ADryLandVolume");

// Class Backrooms.ClientInteractableActor
// 0x0000 (0x0248 - 0x0248)
class AClientInteractableActor : public AInteractableActor
{
public:
	void OnUsed();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClientInteractableActor">();
	}
	static class AClientInteractableActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AClientInteractableActor>();
	}
