#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Backrooms

#include "Basic.hpp"

#include "InteractiveToolsFramework_structs.hpp"
#include "XShip_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Backrooms_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Backrooms.PushableActor.GetClosesPoint
// 0x0018 (0x0018 - 0x0000)
struct PushableActor_GetClosesPoint final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PushableActor_GetClosesPoint) == 0x000008, "Wrong alignment on PushableActor_GetClosesPoint");
static_assert(sizeof(PushableActor_GetClosesPoint) == 0x000018, "Wrong size on PushableActor_GetClosesPoint");
static_assert(offsetof(PushableActor_GetClosesPoint, InActor) == 0x000000, "Member 'PushableActor_GetClosesPoint::InActor' has a wrong offset!");
static_assert(offsetof(PushableActor_GetClosesPoint, ReturnValue) == 0x000008, "Member 'PushableActor_GetClosesPoint::ReturnValue' has a wrong offset!");

// Function Backrooms.PushableActor.GetForwardBoundingPoints
// 0x0018 (0x0018 - 0x0000)
struct PushableActor_GetForwardBoundingPoints final
{
public:
	bool                                          InInvert;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PushableActor_GetForwardBoundingPoints) == 0x000008, "Wrong alignment on PushableActor_GetForwardBoundingPoints");
static_assert(sizeof(PushableActor_GetForwardBoundingPoints) == 0x000018, "Wrong size on PushableActor_GetForwardBoundingPoints");
static_assert(offsetof(PushableActor_GetForwardBoundingPoints, InInvert) == 0x000000, "Member 'PushableActor_GetForwardBoundingPoints::InInvert' has a wrong offset!");
static_assert(offsetof(PushableActor_GetForwardBoundingPoints, ReturnValue) == 0x000008, "Member 'PushableActor_GetForwardBoundingPoints::ReturnValue' has a wrong offset!");

// Function Backrooms.PushableActor.GetRightBoundingPoints
// 0x0018 (0x0018 - 0x0000)
struct PushableActor_GetRightBoundingPoints final
{
public:
	bool                                          InInvert;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PushableActor_GetRightBoundingPoints) == 0x000008, "Wrong alignment on PushableActor_GetRightBoundingPoints");
static_assert(sizeof(PushableActor_GetRightBoundingPoints) == 0x000018, "Wrong size on PushableActor_GetRightBoundingPoints");
static_assert(offsetof(PushableActor_GetRightBoundingPoints, InInvert) == 0x000000, "Member 'PushableActor_GetRightBoundingPoints::InInvert' has a wrong offset!");
static_assert(offsetof(PushableActor_GetRightBoundingPoints, ReturnValue) == 0x000008, "Member 'PushableActor_GetRightBoundingPoints::ReturnValue' has a wrong offset!");

// Function Backrooms.AI_ObjectWC.GetWeight
// 0x0001 (0x0001 - 0x0000)
struct AI_ObjectWC_GetWeight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AI_ObjectWC_GetWeight) == 0x000001, "Wrong alignment on AI_ObjectWC_GetWeight");
static_assert(sizeof(AI_ObjectWC_GetWeight) == 0x000001, "Wrong size on AI_ObjectWC_GetWeight");
static_assert(offsetof(AI_ObjectWC_GetWeight, ReturnValue) == 0x000000, "Member 'AI_ObjectWC_GetWeight::ReturnValue' has a wrong offset!");

// Function Backrooms.MissionData.SetTimeCompleted
// 0x0004 (0x0004 - 0x0000)
struct MissionData_SetTimeCompleted final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MissionData_SetTimeCompleted) == 0x000004, "Wrong alignment on MissionData_SetTimeCompleted");
static_assert(sizeof(MissionData_SetTimeCompleted) == 0x000004, "Wrong size on MissionData_SetTimeCompleted");
static_assert(offsetof(MissionData_SetTimeCompleted, Time) == 0x000000, "Member 'MissionData_SetTimeCompleted::Time' has a wrong offset!");

// Function Backrooms.AimAssistComponent.CheckCanMove
// 0x0001 (0x0001 - 0x0000)
struct AimAssistComponent_CheckCanMove final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimAssistComponent_CheckCanMove) == 0x000001, "Wrong alignment on AimAssistComponent_CheckCanMove");
static_assert(sizeof(AimAssistComponent_CheckCanMove) == 0x000001, "Wrong size on AimAssistComponent_CheckCanMove");
static_assert(offsetof(AimAssistComponent_CheckCanMove, ReturnValue) == 0x000000, "Member 'AimAssistComponent_CheckCanMove::ReturnValue' has a wrong offset!");

// Function Backrooms.AimAssistComponent.OnAimAssistDeviceEnabled
// 0x0001 (0x0001 - 0x0000)
struct AimAssistComponent_OnAimAssistDeviceEnabled final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimAssistComponent_OnAimAssistDeviceEnabled) == 0x000001, "Wrong alignment on AimAssistComponent_OnAimAssistDeviceEnabled");
static_assert(sizeof(AimAssistComponent_OnAimAssistDeviceEnabled) == 0x000001, "Wrong size on AimAssistComponent_OnAimAssistDeviceEnabled");
static_assert(offsetof(AimAssistComponent_OnAimAssistDeviceEnabled, IsGamepad) == 0x000000, "Member 'AimAssistComponent_OnAimAssistDeviceEnabled::IsGamepad' has a wrong offset!");

// Function Backrooms.AimAssistComponent.ProcessAimAssist
// 0x0010 (0x0010 - 0x0000)
struct AimAssistComponent_ProcessAimAssist final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimAssistComponent_ProcessAimAssist) == 0x000004, "Wrong alignment on AimAssistComponent_ProcessAimAssist");
static_assert(sizeof(AimAssistComponent_ProcessAimAssist) == 0x000010, "Wrong size on AimAssistComponent_ProcessAimAssist");
static_assert(offsetof(AimAssistComponent_ProcessAimAssist, DeltaTime) == 0x000000, "Member 'AimAssistComponent_ProcessAimAssist::DeltaTime' has a wrong offset!");
static_assert(offsetof(AimAssistComponent_ProcessAimAssist, ReturnValue) == 0x000004, "Member 'AimAssistComponent_ProcessAimAssist::ReturnValue' has a wrong offset!");

// Function Backrooms.AimAssistComponent.GetCurrentTargetOrDefault
// 0x0038 (0x0038 - 0x0000)
struct AimAssistComponent_GetCurrentTargetOrDefault final
{
public:
	struct FAimAssistTarget                       ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AimAssistComponent_GetCurrentTargetOrDefault) == 0x000008, "Wrong alignment on AimAssistComponent_GetCurrentTargetOrDefault");
static_assert(sizeof(AimAssistComponent_GetCurrentTargetOrDefault) == 0x000038, "Wrong size on AimAssistComponent_GetCurrentTargetOrDefault");
static_assert(offsetof(AimAssistComponent_GetCurrentTargetOrDefault, ReturnValue) == 0x000000, "Member 'AimAssistComponent_GetCurrentTargetOrDefault::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.AddXP
// 0x0008 (0x0008 - 0x0000)
struct BackroomsBPFunctionLibrary_AddXP final
{
public:
	float                                         xpToAdd;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_AddXP) == 0x000004, "Wrong alignment on BackroomsBPFunctionLibrary_AddXP");
static_assert(sizeof(BackroomsBPFunctionLibrary_AddXP) == 0x000008, "Wrong size on BackroomsBPFunctionLibrary_AddXP");
static_assert(offsetof(BackroomsBPFunctionLibrary_AddXP, xpToAdd) == 0x000000, "Member 'BackroomsBPFunctionLibrary_AddXP::xpToAdd' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_AddXP, ReturnValue) == 0x000004, "Member 'BackroomsBPFunctionLibrary_AddXP::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.CanNavigationReachPoint
// 0x0028 (0x0028 - 0x0000)
struct BackroomsBPFunctionLibrary_CanNavigationReachPoint final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartLocation;                                     // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndLocation;                                       // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackroomsBPFunctionLibrary_CanNavigationReachPoint) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_CanNavigationReachPoint");
static_assert(sizeof(BackroomsBPFunctionLibrary_CanNavigationReachPoint) == 0x000028, "Wrong size on BackroomsBPFunctionLibrary_CanNavigationReachPoint");
static_assert(offsetof(BackroomsBPFunctionLibrary_CanNavigationReachPoint, Pawn) == 0x000000, "Member 'BackroomsBPFunctionLibrary_CanNavigationReachPoint::Pawn' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_CanNavigationReachPoint, StartLocation) == 0x000008, "Member 'BackroomsBPFunctionLibrary_CanNavigationReachPoint::StartLocation' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_CanNavigationReachPoint, EndLocation) == 0x000014, "Member 'BackroomsBPFunctionLibrary_CanNavigationReachPoint::EndLocation' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_CanNavigationReachPoint, ReturnValue) == 0x000020, "Member 'BackroomsBPFunctionLibrary_CanNavigationReachPoint::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.ClearCharacterFloor
// 0x0008 (0x0008 - 0x0000)
struct BackroomsBPFunctionLibrary_ClearCharacterFloor final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_ClearCharacterFloor) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_ClearCharacterFloor");
static_assert(sizeof(BackroomsBPFunctionLibrary_ClearCharacterFloor) == 0x000008, "Wrong size on BackroomsBPFunctionLibrary_ClearCharacterFloor");
static_assert(offsetof(BackroomsBPFunctionLibrary_ClearCharacterFloor, Character) == 0x000000, "Member 'BackroomsBPFunctionLibrary_ClearCharacterFloor::Character' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.DetectCurrentGesture
// 0x0020 (0x0020 - 0x0000)
struct BackroomsBPFunctionLibrary_DetectCurrentGesture final
{
public:
	TArray<float>                                 PoseFingerCurls;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UOpenInputGestureDatabase*              GesturesDB;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_DetectCurrentGesture) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_DetectCurrentGesture");
static_assert(sizeof(BackroomsBPFunctionLibrary_DetectCurrentGesture) == 0x000020, "Wrong size on BackroomsBPFunctionLibrary_DetectCurrentGesture");
static_assert(offsetof(BackroomsBPFunctionLibrary_DetectCurrentGesture, PoseFingerCurls) == 0x000000, "Member 'BackroomsBPFunctionLibrary_DetectCurrentGesture::PoseFingerCurls' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_DetectCurrentGesture, GesturesDB) == 0x000010, "Member 'BackroomsBPFunctionLibrary_DetectCurrentGesture::GesturesDB' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_DetectCurrentGesture, ReturnValue) == 0x000018, "Member 'BackroomsBPFunctionLibrary_DetectCurrentGesture::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.GetAllSaveGameSlotNames
// 0x0010 (0x0010 - 0x0000)
struct BackroomsBPFunctionLibrary_GetAllSaveGameSlotNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_GetAllSaveGameSlotNames) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_GetAllSaveGameSlotNames");
static_assert(sizeof(BackroomsBPFunctionLibrary_GetAllSaveGameSlotNames) == 0x000010, "Wrong size on BackroomsBPFunctionLibrary_GetAllSaveGameSlotNames");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetAllSaveGameSlotNames, ReturnValue) == 0x000000, "Member 'BackroomsBPFunctionLibrary_GetAllSaveGameSlotNames::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.GetDateFromSeconds
// 0x0010 (0x0010 - 0x0000)
struct BackroomsBPFunctionLibrary_GetDateFromSeconds final
{
public:
	int32                                         Seconds;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_GetDateFromSeconds) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_GetDateFromSeconds");
static_assert(sizeof(BackroomsBPFunctionLibrary_GetDateFromSeconds) == 0x000010, "Wrong size on BackroomsBPFunctionLibrary_GetDateFromSeconds");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetDateFromSeconds, Seconds) == 0x000000, "Member 'BackroomsBPFunctionLibrary_GetDateFromSeconds::Seconds' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetDateFromSeconds, ReturnValue) == 0x000008, "Member 'BackroomsBPFunctionLibrary_GetDateFromSeconds::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.GetIndexOfClosestSplinePoint
// 0x0018 (0x0018 - 0x0000)
struct BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint final
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldLocation;                                     // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint");
static_assert(sizeof(BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint) == 0x000018, "Wrong size on BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint, SplineComponent) == 0x000000, "Member 'BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint::SplineComponent' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint, WorldLocation) == 0x000008, "Member 'BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint::WorldLocation' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint, ReturnValue) == 0x000014, "Member 'BackroomsBPFunctionLibrary_GetIndexOfClosestSplinePoint::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.GetPlayerStateArray
// 0x0018 (0x0018 - 0x0000)
struct BackroomsBPFunctionLibrary_GetPlayerStateArray final
{
public:
	class AGameStateBase*                         GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APlayerState*>                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_GetPlayerStateArray) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_GetPlayerStateArray");
static_assert(sizeof(BackroomsBPFunctionLibrary_GetPlayerStateArray) == 0x000018, "Wrong size on BackroomsBPFunctionLibrary_GetPlayerStateArray");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetPlayerStateArray, GameState) == 0x000000, "Member 'BackroomsBPFunctionLibrary_GetPlayerStateArray::GameState' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetPlayerStateArray, ReturnValue) == 0x000008, "Member 'BackroomsBPFunctionLibrary_GetPlayerStateArray::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.GetSaveGameSlotsByType
// 0x0020 (0x0020 - 0x0000)
struct BackroomsBPFunctionLibrary_GetSaveGameSlotsByType final
{
public:
	class FString                                 Prefix;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_GetSaveGameSlotsByType) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_GetSaveGameSlotsByType");
static_assert(sizeof(BackroomsBPFunctionLibrary_GetSaveGameSlotsByType) == 0x000020, "Wrong size on BackroomsBPFunctionLibrary_GetSaveGameSlotsByType");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetSaveGameSlotsByType, Prefix) == 0x000000, "Member 'BackroomsBPFunctionLibrary_GetSaveGameSlotsByType::Prefix' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetSaveGameSlotsByType, ReturnValue) == 0x000010, "Member 'BackroomsBPFunctionLibrary_GetSaveGameSlotsByType::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.GetSplinePoints
// 0x0018 (0x0018 - 0x0000)
struct BackroomsBPFunctionLibrary_GetSplinePoints final
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_GetSplinePoints) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_GetSplinePoints");
static_assert(sizeof(BackroomsBPFunctionLibrary_GetSplinePoints) == 0x000018, "Wrong size on BackroomsBPFunctionLibrary_GetSplinePoints");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetSplinePoints, SplineComponent) == 0x000000, "Member 'BackroomsBPFunctionLibrary_GetSplinePoints::SplineComponent' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetSplinePoints, ReturnValue) == 0x000008, "Member 'BackroomsBPFunctionLibrary_GetSplinePoints::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.GetSystemTimeSeconds
// 0x0010 (0x0010 - 0x0000)
struct BackroomsBPFunctionLibrary_GetSystemTimeSeconds final
{
public:
	struct FDateTime                              DateTime;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackroomsBPFunctionLibrary_GetSystemTimeSeconds) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_GetSystemTimeSeconds");
static_assert(sizeof(BackroomsBPFunctionLibrary_GetSystemTimeSeconds) == 0x000010, "Wrong size on BackroomsBPFunctionLibrary_GetSystemTimeSeconds");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetSystemTimeSeconds, DateTime) == 0x000000, "Member 'BackroomsBPFunctionLibrary_GetSystemTimeSeconds::DateTime' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetSystemTimeSeconds, ReturnValue) == 0x000008, "Member 'BackroomsBPFunctionLibrary_GetSystemTimeSeconds::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.GetViewDistanceScale
// 0x0004 (0x0004 - 0x0000)
struct BackroomsBPFunctionLibrary_GetViewDistanceScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_GetViewDistanceScale) == 0x000004, "Wrong alignment on BackroomsBPFunctionLibrary_GetViewDistanceScale");
static_assert(sizeof(BackroomsBPFunctionLibrary_GetViewDistanceScale) == 0x000004, "Wrong size on BackroomsBPFunctionLibrary_GetViewDistanceScale");
static_assert(offsetof(BackroomsBPFunctionLibrary_GetViewDistanceScale, ReturnValue) == 0x000000, "Member 'BackroomsBPFunctionLibrary_GetViewDistanceScale::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.IsNoHMDMode
// 0x0001 (0x0001 - 0x0000)
struct BackroomsBPFunctionLibrary_IsNoHMDMode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_IsNoHMDMode) == 0x000001, "Wrong alignment on BackroomsBPFunctionLibrary_IsNoHMDMode");
static_assert(sizeof(BackroomsBPFunctionLibrary_IsNoHMDMode) == 0x000001, "Wrong size on BackroomsBPFunctionLibrary_IsNoHMDMode");
static_assert(offsetof(BackroomsBPFunctionLibrary_IsNoHMDMode, ReturnValue) == 0x000000, "Member 'BackroomsBPFunctionLibrary_IsNoHMDMode::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.K2_IsTearingDown
// 0x0010 (0x0010 - 0x0000)
struct BackroomsBPFunctionLibrary_K2_IsTearingDown final
{
public:
	class UObject*                                caller;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isTearingDown;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BackroomsBPFunctionLibrary_K2_IsTearingDown) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_K2_IsTearingDown");
static_assert(sizeof(BackroomsBPFunctionLibrary_K2_IsTearingDown) == 0x000010, "Wrong size on BackroomsBPFunctionLibrary_K2_IsTearingDown");
static_assert(offsetof(BackroomsBPFunctionLibrary_K2_IsTearingDown, caller) == 0x000000, "Member 'BackroomsBPFunctionLibrary_K2_IsTearingDown::caller' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_K2_IsTearingDown, isTearingDown) == 0x000008, "Member 'BackroomsBPFunctionLibrary_K2_IsTearingDown::isTearingDown' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.LoadXP
// 0x0004 (0x0004 - 0x0000)
struct BackroomsBPFunctionLibrary_LoadXP final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_LoadXP) == 0x000004, "Wrong alignment on BackroomsBPFunctionLibrary_LoadXP");
static_assert(sizeof(BackroomsBPFunctionLibrary_LoadXP) == 0x000004, "Wrong size on BackroomsBPFunctionLibrary_LoadXP");
static_assert(offsetof(BackroomsBPFunctionLibrary_LoadXP, ReturnValue) == 0x000000, "Member 'BackroomsBPFunctionLibrary_LoadXP::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.PatchMissingInputActions
// 0x0010 (0x0010 - 0x0000)
struct BackroomsBPFunctionLibrary_PatchMissingInputActions final
{
public:
	TArray<struct FInputActionKeyMapping>         NewActions;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_PatchMissingInputActions) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_PatchMissingInputActions");
static_assert(sizeof(BackroomsBPFunctionLibrary_PatchMissingInputActions) == 0x000010, "Wrong size on BackroomsBPFunctionLibrary_PatchMissingInputActions");
static_assert(offsetof(BackroomsBPFunctionLibrary_PatchMissingInputActions, NewActions) == 0x000000, "Member 'BackroomsBPFunctionLibrary_PatchMissingInputActions::NewActions' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.PlayRate
// 0x0018 (0x0018 - 0x0000)
struct BackroomsBPFunctionLibrary_PlayRate final
{
public:
	class UTimelineComponent*                     Timeline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Sec;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_PlayRate) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_PlayRate");
static_assert(sizeof(BackroomsBPFunctionLibrary_PlayRate) == 0x000018, "Wrong size on BackroomsBPFunctionLibrary_PlayRate");
static_assert(offsetof(BackroomsBPFunctionLibrary_PlayRate, Timeline) == 0x000000, "Member 'BackroomsBPFunctionLibrary_PlayRate::Timeline' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_PlayRate, Sec) == 0x000008, "Member 'BackroomsBPFunctionLibrary_PlayRate::Sec' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_PlayRate, ReturnValue) == 0x000010, "Member 'BackroomsBPFunctionLibrary_PlayRate::ReturnValue' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.ResetWorldTime
// 0x0008 (0x0008 - 0x0000)
struct BackroomsBPFunctionLibrary_ResetWorldTime final
{
public:
	const class AGameMode*                        GameMode;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_ResetWorldTime) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_ResetWorldTime");
static_assert(sizeof(BackroomsBPFunctionLibrary_ResetWorldTime) == 0x000008, "Wrong size on BackroomsBPFunctionLibrary_ResetWorldTime");
static_assert(offsetof(BackroomsBPFunctionLibrary_ResetWorldTime, GameMode) == 0x000000, "Member 'BackroomsBPFunctionLibrary_ResetWorldTime::GameMode' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.SaveToClipboard
// 0x0010 (0x0010 - 0x0000)
struct BackroomsBPFunctionLibrary_SaveToClipboard final
{
public:
	class FString                                 ToClipboard;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_SaveToClipboard) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_SaveToClipboard");
static_assert(sizeof(BackroomsBPFunctionLibrary_SaveToClipboard) == 0x000010, "Wrong size on BackroomsBPFunctionLibrary_SaveToClipboard");
static_assert(offsetof(BackroomsBPFunctionLibrary_SaveToClipboard, ToClipboard) == 0x000000, "Member 'BackroomsBPFunctionLibrary_SaveToClipboard::ToClipboard' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.SetCurrentLevelLogs
// 0x0010 (0x0010 - 0x0000)
struct BackroomsBPFunctionLibrary_SetCurrentLevelLogs final
{
public:
	class FString                                 LevelName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_SetCurrentLevelLogs) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_SetCurrentLevelLogs");
static_assert(sizeof(BackroomsBPFunctionLibrary_SetCurrentLevelLogs) == 0x000010, "Wrong size on BackroomsBPFunctionLibrary_SetCurrentLevelLogs");
static_assert(offsetof(BackroomsBPFunctionLibrary_SetCurrentLevelLogs, LevelName) == 0x000000, "Member 'BackroomsBPFunctionLibrary_SetCurrentLevelLogs::LevelName' has a wrong offset!");

// Function Backrooms.BackroomsBPFunctionLibrary.SetLogValue
// 0x0020 (0x0020 - 0x0000)
struct BackroomsBPFunctionLibrary_SetLogValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BackroomsBPFunctionLibrary_SetLogValue) == 0x000008, "Wrong alignment on BackroomsBPFunctionLibrary_SetLogValue");
static_assert(sizeof(BackroomsBPFunctionLibrary_SetLogValue) == 0x000020, "Wrong size on BackroomsBPFunctionLibrary_SetLogValue");
static_assert(offsetof(BackroomsBPFunctionLibrary_SetLogValue, Key) == 0x000000, "Member 'BackroomsBPFunctionLibrary_SetLogValue::Key' has a wrong offset!");
static_assert(offsetof(BackroomsBPFunctionLibrary_SetLogValue, Value) == 0x000010, "Member 'BackroomsBPFunctionLibrary_SetLogValue::Value' has a wrong offset!");

// Function Backrooms.BoatComponent.GetShipBoundsRadius
// 0x0004 (0x0004 - 0x0000)
struct BoatComponent_GetShipBoundsRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoatComponent_GetShipBoundsRadius) == 0x000004, "Wrong alignment on BoatComponent_GetShipBoundsRadius");
static_assert(sizeof(BoatComponent_GetShipBoundsRadius) == 0x000004, "Wrong size on BoatComponent_GetShipBoundsRadius");
static_assert(offsetof(BoatComponent_GetShipBoundsRadius, ReturnValue) == 0x000000, "Member 'BoatComponent_GetShipBoundsRadius::ReturnValue' has a wrong offset!");

// Function Backrooms.BoatComponent.GetXShipPawn
// 0x0008 (0x0008 - 0x0000)
struct BoatComponent_GetXShipPawn final
{
public:
	class ABoatPawn*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoatComponent_GetXShipPawn) == 0x000008, "Wrong alignment on BoatComponent_GetXShipPawn");
static_assert(sizeof(BoatComponent_GetXShipPawn) == 0x000008, "Wrong size on BoatComponent_GetXShipPawn");
static_assert(offsetof(BoatComponent_GetXShipPawn, ReturnValue) == 0x000000, "Member 'BoatComponent_GetXShipPawn::ReturnValue' has a wrong offset!");

// Function Backrooms.BoatComponent.IsEngineInWater
// 0x0001 (0x0001 - 0x0000)
struct BoatComponent_IsEngineInWater final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoatComponent_IsEngineInWater) == 0x000001, "Wrong alignment on BoatComponent_IsEngineInWater");
static_assert(sizeof(BoatComponent_IsEngineInWater) == 0x000001, "Wrong size on BoatComponent_IsEngineInWater");
static_assert(offsetof(BoatComponent_IsEngineInWater, ReturnValue) == 0x000000, "Member 'BoatComponent_IsEngineInWater::ReturnValue' has a wrong offset!");

// Function Backrooms.BoatComponent.Server_PassMovementInfo
// 0x0030 (0x0030 - 0x0000)
struct BoatComponent_Server_PassMovementInfo final
{
public:
	struct FRepXShipMovement                      NewRepXShipMovement;                               // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoatComponent_Server_PassMovementInfo) == 0x000004, "Wrong alignment on BoatComponent_Server_PassMovementInfo");
static_assert(sizeof(BoatComponent_Server_PassMovementInfo) == 0x000030, "Wrong size on BoatComponent_Server_PassMovementInfo");
static_assert(offsetof(BoatComponent_Server_PassMovementInfo, NewRepXShipMovement) == 0x000000, "Member 'BoatComponent_Server_PassMovementInfo::NewRepXShipMovement' has a wrong offset!");

// Function Backrooms.FancyCharacter.ChangeCrosshairVisibility
// 0x0001 (0x0001 - 0x0000)
struct FancyCharacter_ChangeCrosshairVisibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_ChangeCrosshairVisibility) == 0x000001, "Wrong alignment on FancyCharacter_ChangeCrosshairVisibility");
static_assert(sizeof(FancyCharacter_ChangeCrosshairVisibility) == 0x000001, "Wrong size on FancyCharacter_ChangeCrosshairVisibility");
static_assert(offsetof(FancyCharacter_ChangeCrosshairVisibility, IsVisible) == 0x000000, "Member 'FancyCharacter_ChangeCrosshairVisibility::IsVisible' has a wrong offset!");

// Function Backrooms.FancyCharacter.HideItem
// 0x0001 (0x0001 - 0x0000)
struct FancyCharacter_HideItem final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_HideItem) == 0x000001, "Wrong alignment on FancyCharacter_HideItem");
static_assert(sizeof(FancyCharacter_HideItem) == 0x000001, "Wrong size on FancyCharacter_HideItem");
static_assert(offsetof(FancyCharacter_HideItem, IsVisible) == 0x000000, "Member 'FancyCharacter_HideItem::IsVisible' has a wrong offset!");

// Function Backrooms.FancyCharacter.Interact
// 0x0008 (0x0008 - 0x0000)
struct FancyCharacter_Interact final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_Interact) == 0x000008, "Wrong alignment on FancyCharacter_Interact");
static_assert(sizeof(FancyCharacter_Interact) == 0x000008, "Wrong size on FancyCharacter_Interact");
static_assert(offsetof(FancyCharacter_Interact, Actor) == 0x000000, "Member 'FancyCharacter_Interact::Actor' has a wrong offset!");

// Function Backrooms.FancyCharacter.InteractCallBackVR
// 0x0008 (0x0008 - 0x0000)
struct FancyCharacter_InteractCallBackVR final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_InteractCallBackVR) == 0x000008, "Wrong alignment on FancyCharacter_InteractCallBackVR");
static_assert(sizeof(FancyCharacter_InteractCallBackVR) == 0x000008, "Wrong size on FancyCharacter_InteractCallBackVR");
static_assert(offsetof(FancyCharacter_InteractCallBackVR, Actor) == 0x000000, "Member 'FancyCharacter_InteractCallBackVR::Actor' has a wrong offset!");

// Function Backrooms.FancyCharacter.KillPlayer
// 0x0001 (0x0001 - 0x0000)
struct FancyCharacter_KillPlayer final
{
public:
	bool                                          bResetInteractable;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_KillPlayer) == 0x000001, "Wrong alignment on FancyCharacter_KillPlayer");
static_assert(sizeof(FancyCharacter_KillPlayer) == 0x000001, "Wrong size on FancyCharacter_KillPlayer");
static_assert(offsetof(FancyCharacter_KillPlayer, bResetInteractable) == 0x000000, "Member 'FancyCharacter_KillPlayer::bResetInteractable' has a wrong offset!");

// Function Backrooms.FancyCharacter.OnSanityUpdate
// 0x0004 (0x0004 - 0x0000)
struct FancyCharacter_OnSanityUpdate final
{
public:
	float                                         Sanity;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_OnSanityUpdate) == 0x000004, "Wrong alignment on FancyCharacter_OnSanityUpdate");
static_assert(sizeof(FancyCharacter_OnSanityUpdate) == 0x000004, "Wrong size on FancyCharacter_OnSanityUpdate");
static_assert(offsetof(FancyCharacter_OnSanityUpdate, Sanity) == 0x000000, "Member 'FancyCharacter_OnSanityUpdate::Sanity' has a wrong offset!");

// Function Backrooms.FancyCharacter.SetCanCollide
// 0x0001 (0x0001 - 0x0000)
struct FancyCharacter_SetCanCollide final
{
public:
	bool                                          ShouldCollide;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_SetCanCollide) == 0x000001, "Wrong alignment on FancyCharacter_SetCanCollide");
static_assert(sizeof(FancyCharacter_SetCanCollide) == 0x000001, "Wrong size on FancyCharacter_SetCanCollide");
static_assert(offsetof(FancyCharacter_SetCanCollide, ShouldCollide) == 0x000000, "Member 'FancyCharacter_SetCanCollide::ShouldCollide' has a wrong offset!");

// Function Backrooms.FancyCharacter.SetIsOverlapOnly
// 0x0001 (0x0001 - 0x0000)
struct FancyCharacter_SetIsOverlapOnly final
{
public:
	bool                                          ShouldOverlapOnly;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_SetIsOverlapOnly) == 0x000001, "Wrong alignment on FancyCharacter_SetIsOverlapOnly");
static_assert(sizeof(FancyCharacter_SetIsOverlapOnly) == 0x000001, "Wrong size on FancyCharacter_SetIsOverlapOnly");
static_assert(offsetof(FancyCharacter_SetIsOverlapOnly, ShouldOverlapOnly) == 0x000000, "Member 'FancyCharacter_SetIsOverlapOnly::ShouldOverlapOnly' has a wrong offset!");

// Function Backrooms.FancyCharacter.ToggleBlur
// 0x0001 (0x0001 - 0x0000)
struct FancyCharacter_ToggleBlur final
{
public:
	bool                                          ShouldBlur;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_ToggleBlur) == 0x000001, "Wrong alignment on FancyCharacter_ToggleBlur");
static_assert(sizeof(FancyCharacter_ToggleBlur) == 0x000001, "Wrong size on FancyCharacter_ToggleBlur");
static_assert(offsetof(FancyCharacter_ToggleBlur, ShouldBlur) == 0x000000, "Member 'FancyCharacter_ToggleBlur::ShouldBlur' has a wrong offset!");

// Function Backrooms.FancyCharacter.TogglePlayerLegs
// 0x0001 (0x0001 - 0x0000)
struct FancyCharacter_TogglePlayerLegs final
{
public:
	bool                                          IsHidden;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_TogglePlayerLegs) == 0x000001, "Wrong alignment on FancyCharacter_TogglePlayerLegs");
static_assert(sizeof(FancyCharacter_TogglePlayerLegs) == 0x000001, "Wrong size on FancyCharacter_TogglePlayerLegs");
static_assert(offsetof(FancyCharacter_TogglePlayerLegs, IsHidden) == 0x000000, "Member 'FancyCharacter_TogglePlayerLegs::IsHidden' has a wrong offset!");

// Function Backrooms.FancyCharacter.TogglePlayerVisibility
// 0x0001 (0x0001 - 0x0000)
struct FancyCharacter_TogglePlayerVisibility final
{
public:
	bool                                          IsHidden;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_TogglePlayerVisibility) == 0x000001, "Wrong alignment on FancyCharacter_TogglePlayerVisibility");
static_assert(sizeof(FancyCharacter_TogglePlayerVisibility) == 0x000001, "Wrong size on FancyCharacter_TogglePlayerVisibility");
static_assert(offsetof(FancyCharacter_TogglePlayerVisibility, IsHidden) == 0x000000, "Member 'FancyCharacter_TogglePlayerVisibility::IsHidden' has a wrong offset!");

// Function Backrooms.FancyCharacter.GetCurrentInteractableActor
// 0x0008 (0x0008 - 0x0000)
struct FancyCharacter_GetCurrentInteractableActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCharacter_GetCurrentInteractableActor) == 0x000008, "Wrong alignment on FancyCharacter_GetCurrentInteractableActor");
static_assert(sizeof(FancyCharacter_GetCurrentInteractableActor) == 0x000008, "Wrong size on FancyCharacter_GetCurrentInteractableActor");
static_assert(offsetof(FancyCharacter_GetCurrentInteractableActor, ReturnValue) == 0x000000, "Member 'FancyCharacter_GetCurrentInteractableActor::ReturnValue' has a wrong offset!");

// Function Backrooms.InteractablePawn.OnAttemptUse
// 0x0001 (0x0001 - 0x0000)
struct InteractablePawn_OnAttemptUse final
{
public:
	bool                                          CanUse;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractablePawn_OnAttemptUse) == 0x000001, "Wrong alignment on InteractablePawn_OnAttemptUse");
static_assert(sizeof(InteractablePawn_OnAttemptUse) == 0x000001, "Wrong size on InteractablePawn_OnAttemptUse");
static_assert(offsetof(InteractablePawn_OnAttemptUse, CanUse) == 0x000000, "Member 'InteractablePawn_OnAttemptUse::CanUse' has a wrong offset!");

// Function Backrooms.InteractablePawn.OnHiddenPossess
// 0x0008 (0x0008 - 0x0000)
struct InteractablePawn_OnHiddenPossess final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractablePawn_OnHiddenPossess) == 0x000008, "Wrong alignment on InteractablePawn_OnHiddenPossess");
static_assert(sizeof(InteractablePawn_OnHiddenPossess) == 0x000008, "Wrong size on InteractablePawn_OnHiddenPossess");
static_assert(offsetof(InteractablePawn_OnHiddenPossess, Character) == 0x000000, "Member 'InteractablePawn_OnHiddenPossess::Character' has a wrong offset!");

// Function Backrooms.InteractablePawn.OnStartInteracting
// 0x0008 (0x0008 - 0x0000)
struct InteractablePawn_OnStartInteracting final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractablePawn_OnStartInteracting) == 0x000008, "Wrong alignment on InteractablePawn_OnStartInteracting");
static_assert(sizeof(InteractablePawn_OnStartInteracting) == 0x000008, "Wrong size on InteractablePawn_OnStartInteracting");
static_assert(offsetof(InteractablePawn_OnStartInteracting, Character) == 0x000000, "Member 'InteractablePawn_OnStartInteracting::Character' has a wrong offset!");

// Function Backrooms.InteractablePawn.OnUsedServer
// 0x0008 (0x0008 - 0x0000)
struct InteractablePawn_OnUsedServer final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractablePawn_OnUsedServer) == 0x000008, "Wrong alignment on InteractablePawn_OnUsedServer");
static_assert(sizeof(InteractablePawn_OnUsedServer) == 0x000008, "Wrong size on InteractablePawn_OnUsedServer");
static_assert(offsetof(InteractablePawn_OnUsedServer, Character) == 0x000000, "Member 'InteractablePawn_OnUsedServer::Character' has a wrong offset!");

// Function Backrooms.InteractablePawn.OnVRPossess
// 0x0001 (0x0001 - 0x0000)
struct InteractablePawn_OnVRPossess final
{
public:
	bool                                          bPossess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractablePawn_OnVRPossess) == 0x000001, "Wrong alignment on InteractablePawn_OnVRPossess");
static_assert(sizeof(InteractablePawn_OnVRPossess) == 0x000001, "Wrong size on InteractablePawn_OnVRPossess");
static_assert(offsetof(InteractablePawn_OnVRPossess, bPossess) == 0x000000, "Member 'InteractablePawn_OnVRPossess::bPossess' has a wrong offset!");

// Function Backrooms.InteractablePawn.SetCameraPostProcessing
// 0x0008 (0x0008 - 0x0000)
struct InteractablePawn_SetCameraPostProcessing final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractablePawn_SetCameraPostProcessing) == 0x000008, "Wrong alignment on InteractablePawn_SetCameraPostProcessing");
static_assert(sizeof(InteractablePawn_SetCameraPostProcessing) == 0x000008, "Wrong size on InteractablePawn_SetCameraPostProcessing");
static_assert(offsetof(InteractablePawn_SetCameraPostProcessing, Character) == 0x000000, "Member 'InteractablePawn_SetCameraPostProcessing::Character' has a wrong offset!");

// Function Backrooms.InteractablePawn.SetUsingVR
// 0x0010 (0x0010 - 0x0000)
struct InteractablePawn_SetUsingVR final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPossess;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InteractablePawn_SetUsingVR) == 0x000008, "Wrong alignment on InteractablePawn_SetUsingVR");
static_assert(sizeof(InteractablePawn_SetUsingVR) == 0x000010, "Wrong size on InteractablePawn_SetUsingVR");
static_assert(offsetof(InteractablePawn_SetUsingVR, Character) == 0x000000, "Member 'InteractablePawn_SetUsingVR::Character' has a wrong offset!");
static_assert(offsetof(InteractablePawn_SetUsingVR, bPossess) == 0x000008, "Member 'InteractablePawn_SetUsingVR::bPossess' has a wrong offset!");

// Function Backrooms.InteractablePawn.ToggleMouse
// 0x0001 (0x0001 - 0x0000)
struct InteractablePawn_ToggleMouse final
{
public:
	bool                                          bHide;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractablePawn_ToggleMouse) == 0x000001, "Wrong alignment on InteractablePawn_ToggleMouse");
static_assert(sizeof(InteractablePawn_ToggleMouse) == 0x000001, "Wrong size on InteractablePawn_ToggleMouse");
static_assert(offsetof(InteractablePawn_ToggleMouse, bHide) == 0x000000, "Member 'InteractablePawn_ToggleMouse::bHide' has a wrong offset!");

// Function Backrooms.BoatPawn.AddRotationInput
// 0x0004 (0x0004 - 0x0000)
struct BoatPawn_AddRotationInput final
{
public:
	float                                         ScaleValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoatPawn_AddRotationInput) == 0x000004, "Wrong alignment on BoatPawn_AddRotationInput");
static_assert(sizeof(BoatPawn_AddRotationInput) == 0x000004, "Wrong size on BoatPawn_AddRotationInput");
static_assert(offsetof(BoatPawn_AddRotationInput, ScaleValue) == 0x000000, "Member 'BoatPawn_AddRotationInput::ScaleValue' has a wrong offset!");

// Function Backrooms.BoatPawn.GetWaterDensity
// 0x000C (0x000C - 0x0000)
struct BoatPawn_GetWaterDensity final
{
public:
	struct FVector2D                              InLocation;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoatPawn_GetWaterDensity) == 0x000004, "Wrong alignment on BoatPawn_GetWaterDensity");
static_assert(sizeof(BoatPawn_GetWaterDensity) == 0x00000C, "Wrong size on BoatPawn_GetWaterDensity");
static_assert(offsetof(BoatPawn_GetWaterDensity, InLocation) == 0x000000, "Member 'BoatPawn_GetWaterDensity::InLocation' has a wrong offset!");
static_assert(offsetof(BoatPawn_GetWaterDensity, ReturnValue) == 0x000008, "Member 'BoatPawn_GetWaterDensity::ReturnValue' has a wrong offset!");

// Function Backrooms.BoatPawn.GetWaterNormal
// 0x0014 (0x0014 - 0x0000)
struct BoatPawn_GetWaterNormal final
{
public:
	struct FVector2D                              InLocation;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoatPawn_GetWaterNormal) == 0x000004, "Wrong alignment on BoatPawn_GetWaterNormal");
static_assert(sizeof(BoatPawn_GetWaterNormal) == 0x000014, "Wrong size on BoatPawn_GetWaterNormal");
static_assert(offsetof(BoatPawn_GetWaterNormal, InLocation) == 0x000000, "Member 'BoatPawn_GetWaterNormal::InLocation' has a wrong offset!");
static_assert(offsetof(BoatPawn_GetWaterNormal, ReturnValue) == 0x000008, "Member 'BoatPawn_GetWaterNormal::ReturnValue' has a wrong offset!");

// Function Backrooms.BoatPawn.GetWaterWorldZ
// 0x000C (0x000C - 0x0000)
struct BoatPawn_GetWaterWorldZ final
{
public:
	struct FVector2D                              InLocation;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoatPawn_GetWaterWorldZ) == 0x000004, "Wrong alignment on BoatPawn_GetWaterWorldZ");
static_assert(sizeof(BoatPawn_GetWaterWorldZ) == 0x00000C, "Wrong size on BoatPawn_GetWaterWorldZ");
static_assert(offsetof(BoatPawn_GetWaterWorldZ, InLocation) == 0x000000, "Member 'BoatPawn_GetWaterWorldZ::InLocation' has a wrong offset!");
static_assert(offsetof(BoatPawn_GetWaterWorldZ, ReturnValue) == 0x000008, "Member 'BoatPawn_GetWaterWorldZ::ReturnValue' has a wrong offset!");

// Function Backrooms.BoatPawn.GetXShipComponent
// 0x0008 (0x0008 - 0x0000)
struct BoatPawn_GetXShipComponent final
{
public:
	class UBoatComponent*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoatPawn_GetXShipComponent) == 0x000008, "Wrong alignment on BoatPawn_GetXShipComponent");
static_assert(sizeof(BoatPawn_GetXShipComponent) == 0x000008, "Wrong size on BoatPawn_GetXShipComponent");
static_assert(offsetof(BoatPawn_GetXShipComponent, ReturnValue) == 0x000000, "Member 'BoatPawn_GetXShipComponent::ReturnValue' has a wrong offset!");

// Function Backrooms.FancyCarrySystemCarrier.OnRep_CurrentCarryable
// 0x0008 (0x0008 - 0x0000)
struct FancyCarrySystemCarrier_OnRep_CurrentCarryable final
{
public:
	class UFancyCarrySystemCarryable*             PreviousCarryable;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FancyCarrySystemCarrier_OnRep_CurrentCarryable) == 0x000008, "Wrong alignment on FancyCarrySystemCarrier_OnRep_CurrentCarryable");
