#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Scanner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Backrooms_structs.hpp"


namespace SDK::Params
{

// Function BP_Scanner.BP_Scanner_C.ExecuteUbergraph_BP_Scanner
// 0x0560 (0x0560 - 0x0000)
struct BP_Scanner_C_ExecuteUbergraph_BP_Scanner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnable_1;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTargetsStruct>                 K2Node_ComponentBoundEvent_OutTargets;             // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FTelemetryStruct                       K2Node_ComponentBoundEvent_OutTelemetry;           // 0x0030(0x0008)(NoDestructor)
	float                                         K2Node_CustomEvent_NewDistance;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x00B0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0120(0x0010)(ReferenceParm)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0138(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0150(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0168(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01B8(0x0018)()
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x01E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01F8(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0240(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0250(0x0018)()
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_4;                          // 0x0278(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_ScannerTraceCalc_TraceStart;              // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ScannerTraceCalc_TraceEnd;                // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_BeamStart;                      // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_BeamEnd;                        // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_UpdateMinDistance_ReturnValue;            // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_5;                          // 0x02D8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x02E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_FindCollisionUVSkeletalMesh_UV;           // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindCollisionUVSkeletalMesh_ReturnValue;  // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x038C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39E[0x2];                                      // 0x039E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_FindCollisionUV_UV;                       // 0x041C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindCollisionUV_ReturnValue;              // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FixUVStretching_FixedSize;                // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FixUVStretching_FixedStretch;             // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0438(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44B[0x1];                                      // 0x044B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0454(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0468(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CheckForExistingRT_RenderTarget;          // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0488(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0498(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x04C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FColor                                 K2Node_CustomEvent_Color;                          // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ScannerDirector_C*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ScannerDirector_C*                  CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner) == 0x000008, "Wrong alignment on BP_Scanner_C_ExecuteUbergraph_BP_Scanner");
static_assert(sizeof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner) == 0x000560, "Wrong size on BP_Scanner_C_ExecuteUbergraph_BP_Scanner");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, EntryPoint) == 0x000000, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_DynamicCast_AsBPCharacter_Demo) == 0x000010, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_DynamicCast_AsBPCharacter_Demo' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_CustomEvent_Enable) == 0x000019, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_CustomEvent_bEnable_1) == 0x00001A, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_CustomEvent_bEnable_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_CustomEvent_bEnable) == 0x00001B, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_ComponentBoundEvent_OutTargets) == 0x000020, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_ComponentBoundEvent_OutTargets' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_ComponentBoundEvent_OutTelemetry) == 0x000030, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_ComponentBoundEvent_OutTelemetry' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_CustomEvent_NewDistance) == 0x000038, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_CustomEvent_NewDistance' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_FClamp_ReturnValue) == 0x00003C, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_MakeArray_Array) == 0x0000A0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Conv_FloatToText_ReturnValue) == 0x0000B0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_MakeArray_Array_1) == 0x000120, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000130, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Format_ReturnValue_1) == 0x000138, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000150, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_MakeStruct_FormatArgumentData_2) == 0x000168, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_MakeArray_Array_2) == 0x0001A8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Format_ReturnValue_2) == 0x0001B8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001D0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_VSize_ReturnValue) == 0x0001DC, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Conv_FloatToText_ReturnValue_2) == 0x0001E0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Conv_FloatToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001F8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000238, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_MakeArray_Array_3) == 0x000240, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Format_ReturnValue_3) == 0x000250, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_GetMaterial_ReturnValue) == 0x000268, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000270, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_MakeArray_Array_4) == 0x000278, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_ScannerTraceCalc_TraceStart) == 0x000288, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_ScannerTraceCalc_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_ScannerTraceCalc_TraceEnd) == 0x000294, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_ScannerTraceCalc_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_CustomEvent_BeamStart) == 0x0002A0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_CustomEvent_BeamStart' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_CustomEvent_BeamEnd) == 0x0002AC, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_CustomEvent_BeamEnd' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_HasAuthority_ReturnValue) == 0x0002B8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_UpdateMinDistance_ReturnValue) == 0x0002BC, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_UpdateMinDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, Temp_int_Variable) == 0x0002C0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Percent_IntInt_ReturnValue) == 0x0002C4, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002C8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_Event_DeltaSeconds) == 0x0002CC, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_GetOwner_ReturnValue_1) == 0x0002D0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_MakeArray_Array_5) == 0x0002D8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0002E8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000370, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000374, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_FindCollisionUVSkeletalMesh_UV) == 0x000380, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_FindCollisionUVSkeletalMesh_UV' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_FindCollisionUVSkeletalMesh_ReturnValue) == 0x000388, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_FindCollisionUVSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00038C, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_bBlockingHit) == 0x00039C, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_bInitialOverlap) == 0x00039D, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_Time) == 0x0003A0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_Distance) == 0x0003A4, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_Location) == 0x0003A8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_ImpactPoint) == 0x0003B4, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_Normal) == 0x0003C0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_ImpactNormal) == 0x0003CC, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_PhysMat) == 0x0003D8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_HitActor) == 0x0003E0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_HitComponent) == 0x0003E8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_HitBoneName) == 0x0003F0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_HitItem) == 0x0003F8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_ElementIndex) == 0x0003FC, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_FaceIndex) == 0x000400, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_TraceStart) == 0x000404, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_BreakHitResult_TraceEnd) == 0x000410, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_FindCollisionUV_UV) == 0x00041C, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_FindCollisionUV_UV' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_FindCollisionUV_ReturnValue) == 0x000424, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_FindCollisionUV_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_FixUVStretching_FixedSize) == 0x000428, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_FixUVStretching_FixedSize' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_FixUVStretching_FixedStretch) == 0x00042C, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_FixUVStretching_FixedStretch' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000438, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_IsValid_ReturnValue) == 0x000448, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_IsValid_ReturnValue_1) == 0x000449, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, Temp_bool_IsClosed_Variable) == 0x00044A, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x00044C, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, Temp_bool_Has_Been_Initd_Variable) == 0x000450, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_CreateDelegate_OutputDelegate) == 0x000454, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000468, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000470, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, Temp_bool_Variable) == 0x000474, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_CheckForExistingRT_RenderTarget) == 0x000478, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_CheckForExistingRT_RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_IsValid_ReturnValue_2) == 0x000480, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Add_IntInt_ReturnValue) == 0x000484, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000488, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000498, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0004A8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_Select_Default) == 0x0004AC, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0004B0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0004B8, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_CustomEvent_HitResult) == 0x0004C0, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_CustomEvent_HitResult' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, K2Node_CustomEvent_Color) == 0x000548, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_GetActorOfClass_ReturnValue) == 0x000550, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_ExecuteUbergraph_BP_Scanner, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000558, "Member 'BP_Scanner_C_ExecuteUbergraph_BP_Scanner::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.SRV_Lidar
// 0x008C (0x008C - 0x0000)
struct BP_Scanner_C_SRV_Lidar final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FColor                                 Color;                                             // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scanner_C_SRV_Lidar) == 0x000004, "Wrong alignment on BP_Scanner_C_SRV_Lidar");
static_assert(sizeof(BP_Scanner_C_SRV_Lidar) == 0x00008C, "Wrong size on BP_Scanner_C_SRV_Lidar");
static_assert(offsetof(BP_Scanner_C_SRV_Lidar, HitResult) == 0x000000, "Member 'BP_Scanner_C_SRV_Lidar::HitResult' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_SRV_Lidar, Color) == 0x000088, "Member 'BP_Scanner_C_SRV_Lidar::Color' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.SpawnScannerBeam
// 0x0018 (0x0018 - 0x0000)
struct BP_Scanner_C_SpawnScannerBeam final
{
public:
	struct FVector                                BeamStart;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BeamEnd;                                           // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scanner_C_SpawnScannerBeam) == 0x000004, "Wrong alignment on BP_Scanner_C_SpawnScannerBeam");
static_assert(sizeof(BP_Scanner_C_SpawnScannerBeam) == 0x000018, "Wrong size on BP_Scanner_C_SpawnScannerBeam");
static_assert(offsetof(BP_Scanner_C_SpawnScannerBeam, BeamStart) == 0x000000, "Member 'BP_Scanner_C_SpawnScannerBeam::BeamStart' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_SpawnScannerBeam, BeamEnd) == 0x00000C, "Member 'BP_Scanner_C_SpawnScannerBeam::BeamEnd' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.SetScanDistance
// 0x0004 (0x0004 - 0x0000)
struct BP_Scanner_C_SetScanDistance final
{
public:
	float                                         NewDistance;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scanner_C_SetScanDistance) == 0x000004, "Wrong alignment on BP_Scanner_C_SetScanDistance");
static_assert(sizeof(BP_Scanner_C_SetScanDistance) == 0x000004, "Wrong size on BP_Scanner_C_SetScanDistance");
static_assert(offsetof(BP_Scanner_C_SetScanDistance, NewDistance) == 0x000000, "Member 'BP_Scanner_C_SetScanDistance::NewDistance' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.BndEvt__BP_Scanner_BP_ScannerComponent_K2Node_ComponentBoundEvent_1_ScannerWaveUpdateDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_Scanner_C_BndEvt__BP_Scanner_BP_ScannerComponent_K2Node_ComponentBoundEvent_1_ScannerWaveUpdateDelegate__DelegateSignature final
{
public:
	TArray<struct FTargetsStruct>                 OutTargets;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FTelemetryStruct                       OutTelemetry;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_Scanner_C_BndEvt__BP_Scanner_BP_ScannerComponent_K2Node_ComponentBoundEvent_1_ScannerWaveUpdateDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_Scanner_C_BndEvt__BP_Scanner_BP_ScannerComponent_K2Node_ComponentBoundEvent_1_ScannerWaveUpdateDelegate__DelegateSignature");
static_assert(sizeof(BP_Scanner_C_BndEvt__BP_Scanner_BP_ScannerComponent_K2Node_ComponentBoundEvent_1_ScannerWaveUpdateDelegate__DelegateSignature) == 0x000018, "Wrong size on BP_Scanner_C_BndEvt__BP_Scanner_BP_ScannerComponent_K2Node_ComponentBoundEvent_1_ScannerWaveUpdateDelegate__DelegateSignature");
static_assert(offsetof(BP_Scanner_C_BndEvt__BP_Scanner_BP_ScannerComponent_K2Node_ComponentBoundEvent_1_ScannerWaveUpdateDelegate__DelegateSignature, OutTargets) == 0x000000, "Member 'BP_Scanner_C_BndEvt__BP_Scanner_BP_ScannerComponent_K2Node_ComponentBoundEvent_1_ScannerWaveUpdateDelegate__DelegateSignature::OutTargets' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_BndEvt__BP_Scanner_BP_ScannerComponent_K2Node_ComponentBoundEvent_1_ScannerWaveUpdateDelegate__DelegateSignature, OutTelemetry) == 0x000010, "Member 'BP_Scanner_C_BndEvt__BP_Scanner_BP_ScannerComponent_K2Node_ComponentBoundEvent_1_ScannerWaveUpdateDelegate__DelegateSignature::OutTelemetry' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.SetEnableMotionScanner
// 0x0001 (0x0001 - 0x0000)
struct BP_Scanner_C_SetEnableMotionScanner final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Scanner_C_SetEnableMotionScanner) == 0x000001, "Wrong alignment on BP_Scanner_C_SetEnableMotionScanner");
static_assert(sizeof(BP_Scanner_C_SetEnableMotionScanner) == 0x000001, "Wrong size on BP_Scanner_C_SetEnableMotionScanner");
static_assert(offsetof(BP_Scanner_C_SetEnableMotionScanner, bEnable) == 0x000000, "Member 'BP_Scanner_C_SetEnableMotionScanner::bEnable' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.SetEnableWaveScan
// 0x0001 (0x0001 - 0x0000)
struct BP_Scanner_C_SetEnableWaveScan final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Scanner_C_SetEnableWaveScan) == 0x000001, "Wrong alignment on BP_Scanner_C_SetEnableWaveScan");
static_assert(sizeof(BP_Scanner_C_SetEnableWaveScan) == 0x000001, "Wrong size on BP_Scanner_C_SetEnableWaveScan");
static_assert(offsetof(BP_Scanner_C_SetEnableWaveScan, bEnable) == 0x000000, "Member 'BP_Scanner_C_SetEnableWaveScan::bEnable' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.SetEnableLiDAR
// 0x0001 (0x0001 - 0x0000)
struct BP_Scanner_C_SetEnableLiDAR final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Scanner_C_SetEnableLiDAR) == 0x000001, "Wrong alignment on BP_Scanner_C_SetEnableLiDAR");
static_assert(sizeof(BP_Scanner_C_SetEnableLiDAR) == 0x000001, "Wrong size on BP_Scanner_C_SetEnableLiDAR");
static_assert(offsetof(BP_Scanner_C_SetEnableLiDAR, Enable) == 0x000000, "Member 'BP_Scanner_C_SetEnableLiDAR::Enable' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Scanner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scanner_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Scanner_C_ReceiveTick");
static_assert(sizeof(BP_Scanner_C_ReceiveTick) == 0x000004, "Wrong size on BP_Scanner_C_ReceiveTick");
static_assert(offsetof(BP_Scanner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Scanner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.SetStartEnableMotionScanner
// 0x0008 (0x0008 - 0x0000)
struct BP_Scanner_C_SetStartEnableMotionScanner final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scanner_C_SetStartEnableMotionScanner) == 0x000004, "Wrong alignment on BP_Scanner_C_SetStartEnableMotionScanner");
static_assert(sizeof(BP_Scanner_C_SetStartEnableMotionScanner) == 0x000008, "Wrong size on BP_Scanner_C_SetStartEnableMotionScanner");
static_assert(offsetof(BP_Scanner_C_SetStartEnableMotionScanner, Activate) == 0x000000, "Member 'BP_Scanner_C_SetStartEnableMotionScanner::Activate' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_SetStartEnableMotionScanner, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'BP_Scanner_C_SetStartEnableMotionScanner::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.SoundChangeDistance
// 0x0030 (0x0030 - 0x0000)
struct BP_Scanner_C_SoundChangeDistance final
{
public:
	float                                         NewDistance;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Scanner_C_SoundChangeDistance) == 0x000008, "Wrong alignment on BP_Scanner_C_SoundChangeDistance");
static_assert(sizeof(BP_Scanner_C_SoundChangeDistance) == 0x000030, "Wrong size on BP_Scanner_C_SoundChangeDistance");
static_assert(offsetof(BP_Scanner_C_SoundChangeDistance, NewDistance) == 0x000000, "Member 'BP_Scanner_C_SoundChangeDistance::NewDistance' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_SoundChangeDistance, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_Scanner_C_SoundChangeDistance::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_SoundChangeDistance, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000008, "Member 'BP_Scanner_C_SoundChangeDistance::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_SoundChangeDistance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'BP_Scanner_C_SoundChangeDistance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_SoundChangeDistance, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000018, "Member 'BP_Scanner_C_SoundChangeDistance::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_SoundChangeDistance, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000020, "Member 'BP_Scanner_C_SoundChangeDistance::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_SoundChangeDistance, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_Scanner_C_SoundChangeDistance::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_SoundChangeDistance, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000029, "Member 'BP_Scanner_C_SoundChangeDistance::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Scanner.BP_Scanner_C.OnRep_bIsMotionScannerEnable
// 0x0058 (0x0058 - 0x0000)
struct BP_Scanner_C_OnRep_bIsMotionScannerEnable final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPCharacter_Demo_C*                    K2Node_DynamicCast_AsBPCharacter_Demo;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scanner_C_OnRep_bIsMotionScannerEnable) == 0x000008, "Wrong alignment on BP_Scanner_C_OnRep_bIsMotionScannerEnable");
static_assert(sizeof(BP_Scanner_C_OnRep_bIsMotionScannerEnable) == 0x000058, "Wrong size on BP_Scanner_C_OnRep_bIsMotionScannerEnable");
static_assert(offsetof(BP_Scanner_C_OnRep_bIsMotionScannerEnable, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Scanner_C_OnRep_bIsMotionScannerEnable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_OnRep_bIsMotionScannerEnable, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Scanner_C_OnRep_bIsMotionScannerEnable::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_OnRep_bIsMotionScannerEnable, K2Node_DynamicCast_AsBPCharacter_Demo) == 0x000010, "Member 'BP_Scanner_C_OnRep_bIsMotionScannerEnable::K2Node_DynamicCast_AsBPCharacter_Demo' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_OnRep_bIsMotionScannerEnable, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Scanner_C_OnRep_bIsMotionScannerEnable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_OnRep_bIsMotionScannerEnable, CallFunc_IsLocallyControlled_ReturnValue) == 0x000019, "Member 'BP_Scanner_C_OnRep_bIsMotionScannerEnable::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scanner_C_OnRep_bIsMotionScannerEnable, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BP_Scanner_C_OnRep_bIsMotionScannerEnable::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
