#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractiveGrassManager_BP

#include "Basic.hpp"

#include "FoliageToSpawnInArea_structs.hpp"
#include "FoliageToSpawn_Struct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function InteractiveGrassManager_BP.InteractiveGrassManager_BP_C.ExecuteUbergraph_InteractiveGrassManager_BP
// 0x00B8 (0x00B8 - 0x0000)
struct InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_newDirection;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_newStrength;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AInstancedFoliageActor*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	class AInstancedFoliageActor*                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UINTERACTIVE_FoliageComp_BP_C*>  CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UINTERACTIVE_FoliageComp_BP_C*          CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAtan2_ReturnValue;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP) == 0x000008, "Wrong alignment on InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP");
static_assert(sizeof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP) == 0x0000B8, "Wrong size on InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, EntryPoint) == 0x000000, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x00000C, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, Temp_int_Array_Index_Variable) == 0x000018, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, K2Node_CustomEvent_newDirection) == 0x00001C, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::K2Node_CustomEvent_newDirection' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, K2Node_CustomEvent_newStrength) == 0x000028, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::K2Node_CustomEvent_newStrength' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000030, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_IsPlaying_ReturnValue) == 0x000034, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_IsPlaying_ReturnValue_1) == 0x00003C, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Array_Get_Item) == 0x000050, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000060, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000080, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000084, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_BreakVector_X) == 0x000088, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_BreakVector_Y) == 0x00008C, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_BreakVector_Z) == 0x000090, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000094, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_DegAtan2_ReturnValue) == 0x000098, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Add_FloatFloat_ReturnValue) == 0x00009C, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000A0, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP, CallFunc_Lerp_ReturnValue) == 0x0000B0, "Member 'InteractiveGrassManager_BP_C_ExecuteUbergraph_InteractiveGrassManager_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function InteractiveGrassManager_BP.InteractiveGrassManager_BP_C.SmoothlyChangeWindStrength
// 0x0004 (0x0004 - 0x0000)
struct InteractiveGrassManager_BP_C_SmoothlyChangeWindStrength final
{
public:
	float                                         newStrength;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractiveGrassManager_BP_C_SmoothlyChangeWindStrength) == 0x000004, "Wrong alignment on InteractiveGrassManager_BP_C_SmoothlyChangeWindStrength");
static_assert(sizeof(InteractiveGrassManager_BP_C_SmoothlyChangeWindStrength) == 0x000004, "Wrong size on InteractiveGrassManager_BP_C_SmoothlyChangeWindStrength");
static_assert(offsetof(InteractiveGrassManager_BP_C_SmoothlyChangeWindStrength, newStrength) == 0x000000, "Member 'InteractiveGrassManager_BP_C_SmoothlyChangeWindStrength::newStrength' has a wrong offset!");

// Function InteractiveGrassManager_BP.InteractiveGrassManager_BP_C.SmoothlyChangeWindDirection
// 0x000C (0x000C - 0x0000)
struct InteractiveGrassManager_BP_C_SmoothlyChangeWindDirection final
{
public:
	struct FVector                                newDirection;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractiveGrassManager_BP_C_SmoothlyChangeWindDirection) == 0x000004, "Wrong alignment on InteractiveGrassManager_BP_C_SmoothlyChangeWindDirection");
static_assert(sizeof(InteractiveGrassManager_BP_C_SmoothlyChangeWindDirection) == 0x00000C, "Wrong size on InteractiveGrassManager_BP_C_SmoothlyChangeWindDirection");
static_assert(offsetof(InteractiveGrassManager_BP_C_SmoothlyChangeWindDirection, newDirection) == 0x000000, "Member 'InteractiveGrassManager_BP_C_SmoothlyChangeWindDirection::newDirection' has a wrong offset!");

// Function InteractiveGrassManager_BP.InteractiveGrassManager_BP_C.SpawnFoliage
// 0x0320 (0x0320 - 0x0000)
struct InteractiveGrassManager_BP_C_SpawnFoliage final
{
public:
	bool                                          spawnUnderCursor;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                locationIfNotUnderCursor;                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                normalIfNotUnderCursor;                            // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                minScale;                                          // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MaxScale;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFoliageToSpawn_Struct                 foliageToSpawn;                                    // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          fromCluster;                                       // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          clusterLastIndex;                                  // 0x0049(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Scale;                                             // 0x004C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UINTERACTIVE_FoliageComp_BP_C*          addedFoliageComp;                                  // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UINTERACTIVE_FoliageComp_BP_C*          componentToSpawnWith;                              // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             addedInstanceGrowStartTransform;                   // 0x0070(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             addedInstanceOriginalTransform;                    // 0x00A0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	int32                                         addedInstanceIndex;                                // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                spawnNormal;                                       // 0x00D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            whatToSpawn;                                       // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                whereToSpawn;                                      // 0x00E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UINTERACTIVE_FoliageComp_BP_C*          foundFoliageComp;                                  // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          foundFoliageCompWithThisMesh;                      // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AInteractiveFoliageChunk_BP_C*          CallFunc_AddFoliageChunkActor_addedChunk;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0128(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0138(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AInteractiveFoliageChunk_BP_C*          K2Node_DynamicCast_AsInteractive_Foliage_Chunk_BP; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_GetHitResultUnderCursorByChannel_HitResult; // 0x01D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GetHitResultUnderCursorByChannel_ReturnValue; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25F[0x1];                                      // 0x025F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02E0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstanceWorldSpace_ReturnValue;        // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractiveGrassManager_BP_C_SpawnFoliage) == 0x000010, "Wrong alignment on InteractiveGrassManager_BP_C_SpawnFoliage");
static_assert(sizeof(InteractiveGrassManager_BP_C_SpawnFoliage) == 0x000320, "Wrong size on InteractiveGrassManager_BP_C_SpawnFoliage");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, spawnUnderCursor) == 0x000000, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::spawnUnderCursor' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, locationIfNotUnderCursor) == 0x000004, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::locationIfNotUnderCursor' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, normalIfNotUnderCursor) == 0x000010, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::normalIfNotUnderCursor' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, minScale) == 0x00001C, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::minScale' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, MaxScale) == 0x000028, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::MaxScale' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, foliageToSpawn) == 0x000038, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::foliageToSpawn' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, fromCluster) == 0x000048, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::fromCluster' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, clusterLastIndex) == 0x000049, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::clusterLastIndex' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, Scale) == 0x00004C, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::Scale' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, addedFoliageComp) == 0x000058, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::addedFoliageComp' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, componentToSpawnWith) == 0x000060, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::componentToSpawnWith' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, addedInstanceGrowStartTransform) == 0x000070, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::addedInstanceGrowStartTransform' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, addedInstanceOriginalTransform) == 0x0000A0, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::addedInstanceOriginalTransform' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, addedInstanceIndex) == 0x0000D0, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::addedInstanceIndex' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, spawnNormal) == 0x0000D4, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::spawnNormal' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, whatToSpawn) == 0x0000E0, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::whatToSpawn' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, whereToSpawn) == 0x0000E8, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::whereToSpawn' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, foundFoliageComp) == 0x0000F8, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::foundFoliageComp' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, foundFoliageCompWithThisMesh) == 0x000100, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::foundFoliageCompWithThisMesh' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, Temp_bool_True_if_break_was_hit_Variable) == 0x000101, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_Not_PreBool_ReturnValue) == 0x000102, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, Temp_int_Array_Index_Variable) == 0x000104, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_AddFoliageChunkActor_addedChunk) == 0x000108, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_AddFoliageChunkActor_addedChunk' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000110, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, K2Node_MakeArray_Array) == 0x000118, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, Temp_object_Variable) == 0x000128, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_SphereOverlapActors_OutActors) == 0x000138, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_SphereOverlapActors_ReturnValue) == 0x000148, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_Array_Get_Item) == 0x000150, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_Array_Length_ReturnValue) == 0x000158, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, K2Node_DynamicCast_AsInteractive_Foliage_Chunk_BP) == 0x000160, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::K2Node_DynamicCast_AsInteractive_Foliage_Chunk_BP' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, Temp_int_Loop_Counter_Variable) == 0x00016C, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_Less_IntInt_ReturnValue) == 0x000170, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000171, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BooleanAND_ReturnValue) == 0x000172, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_Add_IntInt_ReturnValue) == 0x000174, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_RandomFloatInRange_ReturnValue) == 0x000178, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00017C, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000180, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakVector_X) == 0x000184, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakVector_Y) == 0x000188, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakVector_Z) == 0x00018C, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_VLerp_ReturnValue) == 0x000190, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00019C, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0001A0, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0001A4, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_MakeRotFromZ_ReturnValue) == 0x0001A8, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_RotatorFromAxisAndAngle_ReturnValue) == 0x0001B4, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_RotatorFromAxisAndAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_GetPlayerController_ReturnValue) == 0x0001C0, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_ComposeRotators_ReturnValue) == 0x0001C8, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_GetHitResultUnderCursorByChannel_HitResult) == 0x0001D4, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_GetHitResultUnderCursorByChannel_HitResult' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_GetHitResultUnderCursorByChannel_ReturnValue) == 0x00025C, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_GetHitResultUnderCursorByChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_bBlockingHit) == 0x00025D, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_bInitialOverlap) == 0x00025E, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_Time) == 0x000260, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_Distance) == 0x000264, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_Location) == 0x000268, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_ImpactPoint) == 0x000274, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_Normal) == 0x000280, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_ImpactNormal) == 0x00028C, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_PhysMat) == 0x000298, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_HitActor) == 0x0002A0, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_HitComponent) == 0x0002A8, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_HitBoneName) == 0x0002B0, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_HitItem) == 0x0002B8, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_ElementIndex) == 0x0002BC, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_FaceIndex) == 0x0002C0, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_TraceStart) == 0x0002C4, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_BreakHitResult_TraceEnd) == 0x0002D0, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_MakeTransform_ReturnValue) == 0x0002E0, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractiveGrassManager_BP_C_SpawnFoliage, CallFunc_AddInstanceWorldSpace_ReturnValue) == 0x000310, "Member 'InteractiveGrassManager_BP_C_SpawnFoliage::CallFunc_AddInstanceWorldSpace_ReturnValue' has a wrong offset!");

// Function InteractiveGrassManager_BP.InteractiveGrassManager_BP_C.SpawnFoliageCluster
// 0x0660 (0x0660 - 0x0000)
struct InteractiveGrassManager_BP_C_SpawnFoliageCluster final
{
public:
	struct FVector                                CenterLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         sizeX_;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         sizeY_;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         density_;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         nonUniformDistribution;                            // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFoliageToSpawn_Struct                 foliageToSpawn;                                    // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                minScale;                                          // 0x0030(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MaxScale;                                          // 0x003C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          useGrassSpawnAreas;                                // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrassSpawnArea_BP_C*                   grassSpawnArea;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          last;                                              // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastIndex;                                         // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrassSpawnArea_BP_C*                   grassSpawnArea_;                                   // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          useGrassSpawnAreas_;                               // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         sectionAmountY_;                                   // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Density;                                           // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeY;                                             // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeX;                                             // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                maxScale_;                                         // 0x007C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                minScale_;                                         // 0x0088(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFoliageToSpawn_Struct                 foliageToSpawn_;                                   // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         nonUniformDistribution_;                           // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                centerLocation_;                                   // 0x00AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SectionSize_;                                      // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         sectionAmountX_;                                   // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        spawnLocationOrigins;                              // 0x00C0(0x0010)(Edit, BlueprintVisible)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x00F0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0100(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
